In [49]:
import numpy as np
import pandas as pd #veri biliminin excel'i

## Seriler

In [50]:
sozluk = {"Ali" : 50 , "Zeynep" : 40 , "Mehmet" : 30}
pd.Series(sozluk)

Ali       50
Zeynep    40
Mehmet    30
dtype: int64

In [51]:
yas = [50,40,30] # numpy dizisiyle de yapılabilir
isim = ["Ali","Zeynep","Mehmet"]
pd.Series(yas,isim) # pd.Series(data=yas,index=isim)

Ali       50
Zeynep    40
Mehmet    30
dtype: int64

In [52]:
yarismaSonucu1=pd.Series([10,5,1],["Ali","Zeynep","Mehmet"])
yarismaSonucu2=pd.Series([20,15,8],["Ali","Zeynep","Mehmet"])
sonuc=yarismaSonucu1+yarismaSonucu2
sonuc

Ali       30
Zeynep    20
Mehmet     9
dtype: int64

In [53]:
yarismaSonucu3=pd.Series([4,9,12],["Ahmet","Zeynep","Mehmet"])
sonuc=sonuc+yarismaSonucu3
sonuc

Ahmet      NaN
Ali        NaN
Mehmet    21.0
Zeynep    29.0
dtype: float64

## Data Frame

In [54]:
veriler = np.random.randn(4,3)
dataFrame = pd.DataFrame(veriler) # excel'e benzetir
dataFrame

          0         1         2
0  0.402335 -0.036583 -1.131570
1 -0.142838 -0.852000 -0.280879
2  0.890631 -0.449569  0.444594
3  0.416868 -0.363875  1.333533

In [55]:
dataFrame[0] # satırı getirir!!!

0    0.402335
1   -0.142838
2    0.890631
3    0.416868
Name: 0, dtype: float64

In [56]:
dataFrame2 = pd.DataFrame(veriler, index= ["Ali","Zeynep","Mehmet","Selim"],
                          columns = ["Maas","Yas","Boy"])
dataFrame2

            Maas       Yas       Boy
Ali     0.402335 -0.036583 -1.131570
Zeynep -0.142838 -0.852000 -0.280879
Mehmet  0.890631 -0.449569  0.444594
Selim   0.416868 -0.363875  1.333533

In [57]:
dataFrame2[["Yas","Boy"]]

             Yas       Boy
Ali    -0.036583 -1.131570
Zeynep -0.852000 -0.280879
Mehmet -0.449569  0.444594
Selim  -0.363875  1.333533

In [58]:
dataFrame2["Maas"]

Ali       0.402335
Zeynep   -0.142838
Mehmet    0.890631
Selim     0.416868
Name: Maas, dtype: float64

In [59]:
dataFrame2.loc["Ali"]

Maas    0.402335
Yas    -0.036583
Boy    -1.131570
Name: Ali, dtype: float64

In [60]:
dataFrame2.iloc[0]

Maas    0.402335
Yas    -0.036583
Boy    -1.131570
Name: Ali, dtype: float64

In [61]:
dataFrame2["Emeklilik"]=dataFrame2["Yas"]+dataFrame2["Yas"]
dataFrame2

            Maas       Yas       Boy  Emeklilik
Ali     0.402335 -0.036583 -1.131570  -0.073166
Zeynep -0.142838 -0.852000 -0.280879  -1.704001
Mehmet  0.890631 -0.449569  0.444594  -0.899137
Selim   0.416868 -0.363875  1.333533  -0.727749

In [62]:
dataFrame2.drop("Boy",axis=1) # sütunlarda arama yaptığından sadece ilk sütünde aratıyoruz

            Maas       Yas  Emeklilik
Ali     0.402335 -0.036583  -0.073166
Zeynep -0.142838 -0.852000  -1.704001
Mehmet  0.890631 -0.449569  -0.899137
Selim   0.416868 -0.363875  -0.727749

In [63]:
dataFrame2.drop("Mehmet") #dataFrame2.drop("Mehmet",axis=0)

            Maas       Yas       Boy  Emeklilik
Ali     0.402335 -0.036583 -1.131570  -0.073166
Zeynep -0.142838 -0.852000 -0.280879  -1.704001
Selim   0.416868 -0.363875  1.333533  -0.727749

In [64]:
dataFrame2 #yapılan değişikliklere rağmen ana değişken değişmez

            Maas       Yas       Boy  Emeklilik
Ali     0.402335 -0.036583 -1.131570  -0.073166
Zeynep -0.142838 -0.852000 -0.280879  -1.704001
Mehmet  0.890631 -0.449569  0.444594  -0.899137
Selim   0.416868 -0.363875  1.333533  -0.727749

In [65]:
dataFrame2.drop("Boy",axis=1,inplace=True) # ana değişken değişir
dataFrame2

            Maas       Yas  Emeklilik
Ali     0.402335 -0.036583  -0.073166
Zeynep -0.142838 -0.852000  -1.704001
Mehmet  0.890631 -0.449569  -0.899137
Selim   0.416868 -0.363875  -0.727749

In [66]:
dataFrame2[dataFrame2<0] #NaN gösterir

            Maas       Yas  Emeklilik
Ali          NaN -0.036583  -0.073166
Zeynep -0.142838 -0.852000  -1.704001
Mehmet       NaN -0.449569  -0.899137
Selim        NaN -0.363875  -0.727749

In [67]:
dataFrame2[dataFrame2["Yas"]<0] #Sadece sağlayan değerleri getirir

            Maas       Yas  Emeklilik
Ali     0.402335 -0.036583  -0.073166
Zeynep -0.142838 -0.852000  -1.704001
Mehmet  0.890631 -0.449569  -0.899137
Selim   0.416868 -0.363875  -0.727749

#### index değiştirme

In [68]:
dataFrame2.reset_index() # inplace=True lazımdır!!!

    index      Maas       Yas  Emeklilik
0     Ali  0.402335 -0.036583  -0.073166
1  Zeynep -0.142838 -0.852000  -1.704001
2  Mehmet  0.890631 -0.449569  -0.899137
3   Selim  0.416868 -0.363875  -0.727749

In [77]:
yeniIndexler=["A","Z","M","S"]
dataFrame2["Yeni Indexler"]=yeniIndexler
dataFrame2

                   Maas       Yas  Emeklilik Yeni Indexler
Yeni Indexler
A              0.402335 -0.036583  -0.073166             A
Z             -0.142838 -0.852000  -1.704001             Z
M              0.890631 -0.449569  -0.899137             M
S              0.416868 -0.363875  -0.727749             S

In [78]:
dataFrame2.set_index("Yeni Indexler",inplace=True)
dataFrame2

                   Maas       Yas  Emeklilik
Yeni Indexler
A              0.402335 -0.036583  -0.073166
Z             -0.142838 -0.852000  -1.704001
M              0.890631 -0.449569  -0.899137
S              0.416868 -0.363875  -0.727749

## Multi Index !!!!!

In [82]:
ilkIndexler=["Meyve","Meyve","Meyve","Sebze","Sebze"]
icIndexler = ["Elma","Armut","Karpuz","Domates","Salatalık"]
birlesmisIndexler = list(zip(ilkIndexler,icIndexler))
birlesmisIndexler

[('Meyve', 'Elma'),
 ('Meyve', 'Armut'),
 ('Meyve', 'Karpuz'),
 ('Sebze', 'Domates'),
 ('Sebze', 'Salatalık')]

In [83]:
birlesmisIndexler = pd.MultiIndex.from_tuples(bislesmisIndexler)
bislesmisIndexler

MultiIndex([('Meyve',      'Elma'),
            ('Meyve',     'Armut'),
            ('Meyve',    'Karpuz'),
            ('Sebze',   'Domates'),
            ('Sebze', 'Salatalık')],
           )

In [85]:
yicekler=[[10,"A"],[20,"B"],[30,"C"],[40,"D"],[50,"E"]]
yicekListe=np.array(yicekler)

In [89]:
yicekDataFrame=pd.DataFrame(yicekListe,index=bislesmisIndexler,columns=["Kalori","Kod"])
yicekDataFrame

                Kalori Kod
Meyve Elma          10   A
      Armut         20   B
      Karpuz        30   C
Sebze Domates       40   D
      Salatalık     50   E

In [91]:
yicekDataFrame.loc["Meyve"].loc["Armut"] # direk armut getirilemez

Kalori    20
Kod        B
Name: Armut, dtype: object

In [92]:
yicekDataFrame.index.names = ["Tür","Ad"]
yicekDataFrame

                Kalori Kod
Tür   Ad
Meyve Elma          10   A
      Armut         20   B
      Karpuz        30   C
Sebze Domates       40   D
      Salatalık     50   E

### Eksik Veriler

In [102]:
indexler=np.array(["Ptesi","Salı","Çarş"])
veriler=np.array([[30,20,40],[29,np.nan,39],[np.nan,25,38]])
dataFrame=pd.DataFrame(veriler,index=indexler,columns=["İstanbul","Ankara","İzmir"])
dataFrame

       İstanbul  Ankara  İzmir
Ptesi      30.0    20.0   40.0
Salı       29.0     NaN   39.0
Çarş        NaN    25.0   38.0

##### Silme

In [103]:
dataFrame.dropna() #inplace=True gerekir

       İstanbul  Ankara  İzmir
Ptesi      30.0    20.0   40.0

In [104]:
dataFrame.dropna(axis=1)

       İzmir
Ptesi   40.0
Salı    39.0
Çarş    38.0

In [140]:
yeniVeri={ "İstnabul" : [30,29,np.nan],"Ankara":[20,np.nan,25],"İzmir":[40,39,38],"Antalya":[35,np.nan,np.nan]}
yeniDataFrame=pd.DataFrame(yeniVeri)
yeniDataFrame.isnull()

   İstnabul  Ankara  İzmir  Antalya
0     False   False  False    False
1     False    True  False     True
2      True   False  False     True

In [141]:
yeniDataFrame.dropna(axis=1,thresh=2)

   İstnabul  Ankara  İzmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

##### Değiştirme

In [112]:
yeniDataFrame.fillna(1500)

   İstnabul  Ankara  İzmir  Antalya
0      30.0    20.0     40     35.0
1      29.0  1500.0     39   1500.0
2    1500.0    25.0     38   1500.0

### groupby

In [116]:
maaslar={"Departman":["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
        "Calisan Ismi": ["Ahmet","Mehmet","Ayşe","Burak","Zeynep","Fatma"],
        "Maas":[100,200,300,400,500,600]}
maasDataFrame=pd.DataFrame(maaslar)
maasDataFrame

   Departman Calisan Ismi  Maas
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   200
2  Pazarlama         Ayşe   300
3  Pazarlama        Burak   400
4      Hukuk       Zeynep   500
5      Hukuk        Fatma   600

In [120]:
gruplar=maasDataFrame.groupby("Departman")
print(gruplar.count())
print(gruplar.mean())
print(gruplar.min())
print(gruplar.max())

           Calisan Ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2
           Maas
Departman
Hukuk       550
Pazarlama   350
Yazılım     150
          Calisan Ismi  Maas
Departman
Hukuk            Fatma   500
Pazarlama         Ayşe   300
Yazılım          Ahmet   100
          Calisan Ismi  Maas
Departman
Hukuk           Zeynep   600
Pazarlama        Burak   400
Yazılım         Mehmet   200

In [121]:
gruplar.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  550.0  70.710678  500.0  525.0  550.0  575.0  600.0
Pazarlama   2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0
Yazılım     2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0

## Concatenation (Concat)

In [127]:
sozluk1={"İsim":["Ahmet","Mehmet","Zeynep","Atıl"],
        "Spor":["Koşu","Yüzme","Koşu","Basketbol"],
        "Kalori":[100,200,250,150]}

dataFrame1=pd.DataFrame(sozluk1)

sozluk2={"İsim":["Osman","Levent","Atlas","Fatma"],
        "Spor":["Koşu","Yüzme","Koşu","Basketbol"],
        "Kalori":[100,200,250,150]}

dataFrame2=pd.DataFrame(sozluk2)

sozluk3={"İsim":["Ayşe","Mahmut","Duygu","Nur"],
        "Spor":["Koşu","Yüzme","Badminton","Tenis"],
        "Kalori":[400,500,100,200]}

dataFrame3=pd.DataFrame(sozluk3)

In [128]:
pd.concat([dataFrame1,dataFrame2,dataFrame3]) #axis=1 deseydik yan yana koymaya çalışırdı

     İsim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     250
3    Atıl  Basketbol     150
0   Osman       Koşu     100
1  Levent      Yüzme     200
2   Atlas       Koşu     250
3   Fatma  Basketbol     150
0    Ayşe       Koşu     400
1  Mahmut      Yüzme     500
2   Duygu  Badminton     100
3     Nur      Tenis     200

## Merge

In [130]:
veri1={"İsim":["Ahmet","Mehmet","Zeynep","Atıl"],
        "Spor":["Koşu","Yüzme","Koşu","Basketbol"]}

data1=pd.DataFrame(veri1)

veri2={"İsim":["Ahmet","Mehmet","Zeynep","Atıl"],
        "Kalori":[100,200,250,150]}

data2=pd.DataFrame(veri2)

In [131]:
pd.merge(data1,data2,on="İsim")

     İsim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     250
3    Atıl  Basketbol     150

### Diğer Operasyonlar

In [134]:
maas={"İsim":["Ali","Zeynep","Aslı","Ahmet"],
     "Departman":["Yazılım","Satış","Pazarlama","Yazılım"],
     "Maas":[200,300,400,500]}
maasData=pd.DataFrame(maas)
maasData

     İsim  Departman  Maas
0     Ali    Yazılım   200
1  Zeynep      Satış   300
2    Aslı  Pazarlama   400
3   Ahmet    Yazılım   500

#### unique-nunique-value_counts

In [135]:
maasData["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [136]:
maasData["Departman"].nunique() # number of unique = nunique

3

In [137]:
maasData["Departman"].value_counts()

Yazılım      2
Satış        1
Pazarlama    1
Name: Departman, dtype: int64

#### apply(fonksiyon adapte eder)

In [138]:
def brutToNet(maas):
    return maas*0.66

maasData["Maas"].apply(brutToNet)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

### Pivot Table

In [145]:
yeniVeri={"Tür":["Meyve","Meyve","Sebze","Sebze","Sebze"],
         "Ad":["Elma","Armut","Domates","Salatalık","Salatalık"],
         "Kalori":[10,20,30,40,50]}

yeniData=pd.DataFrame(yeniVeri)

In [146]:
yeniData.pivot_table(values="Kalori",index=["Tür","Ad"]) # Salatalıkların ortalamasını alıp atar

                 Kalori
Tür   Ad
Meyve Armut          20
      Elma           10
Sebze Domates        30
      Salatalık      45

In [147]:
yeniData.pivot_table(values="Kalori",index=["Tür","Ad"],aggfunc=np.sum) # Salatalıkların toplamını atar

                 Kalori
Tür   Ad
Meyve Armut          20
      Elma           10
Sebze Domates        30
      Salatalık      90

## Veri Çekmek

#### Excel'den

In [ ]:
excelDataFrame = pd.read_excel("dosyaAdı.xlsx")

# Excel dosyasıyla pyhton kodu aynı dosyada olmalı!!!
#...

yeniExcelDataFrame.to_excel("yeniDosyaAdı.xlsx")

#### CSV'den

In [ ]:
csvDataFrame=pd.read_csv("dosyaAdı.csv")

# CSV dosyasıyla pyhton kodu aynı dosyada olmalı!!!
#...

yeniCsvDataFrame.to_csv("yeniDosyaAdı.csv")